# SolidCurveIntersectionOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidCurveIntersectionOptions Class
Members See Also
---
This class contains the options used to calculate the intersection between a solid and a curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class SolidCurveIntersectionOptions : IDisposable
```

Visual Basic
---
```text
Public Class SolidCurveIntersectionOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SolidCurveIntersectionOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SolidCurveIntersectionOptions
# See Also
SolidCurveIntersectionOptions Members
Autodesk.Revit.DB Namespace